Revit 2026 API
FaceNode Class
 An output node that represents a Face.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class FaceNode : RenderNode
Public Class FaceNode
	Inherits RenderNode
public ref class FaceNode : public RenderNode
type FaceNode =
    class
        inherit RenderNode
    end
The FaceNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFace |  Returns the Face object corresponding to the node.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: [!:Autodesk::Revit::DB::IExportContext::OnFaceBegin].
See Also
Reference
Autodesk.Revit.DB Namespace